# BendRadius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSize..::..BendRadius Property
ConduitSize Class See Also
---
Minimum bend radius
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double BendRadius { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BendRadius As Double
	Get
```

Visual C++
---
```text
public:
property double BendRadius {
	double get ();
}
```

# See Also
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace